NO_DATA = "Нет данных"

USER_ADDED_SL = "%s добавил занятие на %s в %s"
USER_CANCELED_SL = "%s отменил занятие %s в %s"
USER_DELETED_SL = "%s удалил занятие %s в %s"
USER_MOVED_SL = "%s перенес занятие %s в %s на %s в %s"


LESSONS_ARE_COMING = "🔔 Скоро уроки!%0A"
LESSON_IS_COMING_TEACHER = "Урок у %s в %s"
LESSON_IS_COMING_STUDENT = "Урок в %s"

OUT_OF_WT = "%s стоит вне рабочего времени учителя, поправьте расписание"

BOT_DESCRIPTION = """
Этот бот помогает учителю планировать занятия.
Бот запомнил вас, теперь вы можете редактировать свое расписание уроков.
/help - даст клавиатуру со всеми доступными командами
"""

HELP_MESSAGE = """
С помощью этого бота можно изменять свое расписание занятий.
Добавить урок (/add_lesson) - добавляет урок в расписание на определённый день недели и время (будет повторяться каждую неделю).

Отменить/перенести занятие (/reschedule) - отменяет или переносит занятие на другую дату/время.
Если вы не можете в какой то день прийти на занятие,
то можете его либо разово отменить, либо перенести на другую дату,
либо полностью изименить расписание - бот предложит свободные дни и время.

Время в боте всегда указано по МСК.

Каждый день утром по МСК бот присылает напоминание о предстоящем занятии.
Команда `Помощь` обновляет клавиатуру с кнопками и выводит это сообщение.
"""
GREETINGS = "你好, %s!"
CANCELED = "Отмена"
NOT_REGISTERED = "Вы не зарегистрированы. Пожалуйста воспользуйтесь командой /start"
USER_NOT_FOUND = "Пользователь %s не найден"

CHOOSE_DATE = "Выберите дату"
CHOOSE_TIME = "Выберите время (по МСК)"
LESSON_ADDED = "Урок добавлен"
CHOOSE_LESSON = "Выберите урок для отмены"
NO_LESSONS = "Нет предстоящих уроков"
NO_LESSON = "Урок не найден"
NEW_DATE = "Хотите перенести урок на новую дату/время?"
CHOOSE_NEW_DATE = "Выберите новую дату"
LESSON_CANCELED = "Урок отменён"

SCHEDULE_EMPTY = "На сегодня занятий нет"
SCHEDULE = "Занятия на сегодня:\n"

SCHEDULE_EMPTY_WEEK = "На этой неделе занятий нет"
SCHEDULE_WEEK = "Занятия на этой неделе:\n"

SHOW_WORK_SCHEDULE = "Текущее рабочее расписание:\n"
EDIT_WEEKDAY = "Выберите время для редактирования:\n"
SEND_NEW_TIME = "Напишите новое врем в формате ЧЧ:ММ"
SEND_BREAK_TIME = "Напишите время перерыва в формате ЧЧ:ММ-ЧЧ:ММ"
BREAK_REMOVED = "Перерыв удален"
INVALID_TIME = "Некорректное время"
TIME_UPDATED = "Время обновлено"

PERMISSION_DENIED = "У вас нет доступа к этой команде"
NO_DATA = "Нет данных"

