BOT_DESCRIPTION = """
Этот бот помогает учителю планировать занятия.
Бот запомнил вас, теперь вы можете редактировать свое расписание уроков.
/help - даст клавиатуру со всеми доступными командами
"""

HELP_MESSAGE = """
Если вы получили ошибку `user not found`, тогда введите /start хотя бы раз, чтобы бот вас запомнил.
Список доступных команд:\n
"""
GREETINGS = "你好, %s!"
CANCELED = "Отмена"
NOT_REGISTERED = "Вы не зарегистрированы. Пожалуйста воспользуйтесь командой /start"
USER_NOT_FOUND = "Пользователь %s не найден"

CHOOSE_DATE = "Выберите дату"
CHOOSE_TIME = "Выберите время"
LESSON_ADDED = "Урок добавлен"
CHOOSE_LESSON = "Выберите урок для отмены"
NO_LESSONS = "Нет предстоящих уроков"
NO_LESSON = "Урок не найден"
NEW_DATE = "Хотите перенести урок на новую дату/время?"
CHOOSE_NEW_DATE = "Выберите новую дату"
LESSON_CANCELED = "Урок отменён"

SCHEDULE_EMPTY = "На сегодня занятий нет"
SCHEDULE = "Занятия на сегодня:\n"
