BOT_DESCRIPTION = """
Этот бот помогает учителю планировать занятия.
Бот запомнил вас, теперь вы можете редактировать свое расписание уроков.
/help - даст клавиатуру со всеми доступными командами
"""

HELP_MESSAGE = """
Что хотите сделать?
"""
GREETINGS = "你好, %s!"
CANCELED = "Отмена"
NOT_REGISTERED = "Вы не зарегистрированы. Пожалуйста воспользуйтесь командой /start"
USER_NOT_FOUND = "Пользователь %s не найден"

CHOOSE_DATE = "Выберите дату"
CHOOSE_TIME = "Выберите время (по МСК)"
LESSON_ADDED = "Урок добавлен"
CHOOSE_LESSON = "Выберите урок для отмены"
NO_LESSONS = "Нет предстоящих уроков"
NO_LESSON = "Урок не найден"
NEW_DATE = "Хотите перенести урок на новую дату/время?"
CHOOSE_NEW_DATE = "Выберите новую дату"
LESSON_CANCELED = "Урок отменён"

SCHEDULE_EMPTY = "На сегодня занятий нет"
SCHEDULE = "Занятия на сегодня:\n"

SCHEDULE_EMPTY_WEEK = "На этой неделе занятий нет"
SCHEDULE_WEEK = "Занятия на этой неделе:\n"

SHOW_WORK_SCHEDULE = "Текущее рабочее расписание:\n"
EDIT_WEEKDAY = "Выберите время для редактирования:\n"
SEND_NEW_TIME = "Напишите новое врем в формате ЧЧ:ММ"
SEND_BREAK_TIME = "Напишите время перерыва в формате ЧЧ:ММ-ЧЧ:ММ"
BREAK_REMOVED = "Перерыв удален"
INVALID_TIME = "Некорректное время"
TIME_UPDATED = "Время обновлено"

PERMISSION_DENIED = "У вас нет доступа к этой команде"
NO_DATA = "Нет данных"
